# Instructions: run using "brew bundle"

# Terminal tools
cask 'iterm2'
brew 'bash'
brew 'macvim'
brew 'neovim'
brew 'the_silver_searcher'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Web Development tools
brew 'puma/puma/puma-dev'
brew 'sass/sass/migrator'
cask 'firefox'
cask 'tableplus'
cask 'miro'
cask 'zeplin'

# MacOS interface management tools
cask 'raycast'
cask 'rectangle'
cask 'caffeine'

# Programming languages and related tools
brew 'dart'
brew 'rust' # for running Ruby with the YJIT compiler
brew 'rbenv'
brew 'ruby-build'
brew 'node'
brew 'corepack' # for help with managing versions of your package managers, related to Node.js
brew 'uv' # Python package installer, runner, and virtualenv manager

# Version Control tools
brew 'git'
brew 'gh' # for the GitHub CLI
cask 'github'

# Databases
brew 'sqlite'
brew 'redis'
brew 'postgresql@18'
brew 'pgcli'

# Image processing tools
brew 'vips' # the Rails v7 default for image processing
brew 'poppler' # for creating PDF previews

# Hosting tools
brew 'heroku'
brew 'flyctl'

# For CIRM's infrastructure management
brew 'ansible'
brew 'mise'
brew 'yq' # YAML processor (like jq for YAML)
brew 'awscli' # for syncing DigitalOcean Spaces files from Production to Staging

# For the Open Source Risk Engine (ORE)
brew 'cmake'
brew 'ninja' # Use Ninja for cmake
brew 'boost'
brew 'swig'

# For linting
brew 'hadolint' # Dockerfile linter
brew 'yamllint'
brew 'ansible-lint'
brew 'shellcheck'

# Other programs
cask 'basictex'
cask 'calibre'
cask 'typora'
cask 'zoom'
cask 'cleanmymac'
cask 'qlmarkdown'

# For Claude Code
brew 'gum' # Interactive terminal UI for multi-select menus in Claude Code commands


# brew 'direnv'
# brew 'dnsmasq'
# brew 'docbook'
# brew 'docker'
# brew 'docker-compose'
# brew 'graphviz'
# brew 'httpie'
# brew 'hub' # an extension to command-line git that helps you do everyday GitHub tasks without ever leaving the terminal
# brew 'p7zip'
# cask 'betterzipql'
# cask 'jet'
# cask 'mono-mdk'
# cask 'qlcolorcode'
# cask 'qlprettypatch'
# cask 'qlstephen'
# cask 'quicklook-csv'
# cask 'quicklook-json'
# cask 'sonarr'
# cask 'suspicious-package'
# cask 'webp-quicklook'
